# 3. Transaction Type
trans_type = st.radio("Transaction Type", ["INCOME", "EXPENSE"])

# 4. Category (ఇక్కడ trans_type బదులు రేడియో కీ ని వాడదాం)
if trans_type == "INCOME":
  categories = [
      "ఓపెనింగ్ బ్యాలెన్స్",
      "జీతం / వేతనం",
      "క్రెడిట్ కార్డ్",
      "లోన్",
      "అప్పు",
  ]
else:
  categories = [
      "సరుకులు",
      "కూరగాయలు / పండ్లు",
      "పాలు",
      "పెరుగు",
      "పెట్రోలు",
      "క్రెడిట్ కార్డ్ పేమెంట్",
      "వెహికల్ మెయింటెనెన్స్",
      "అప్పు",
      "డ్వాక్రా లోను",
      "కరెంట్ బిల్లు",
      "పేపర్ బిల్లు",
      "టిఫిన్స్ / హోటల్",
      "మూవీస్",
      "క్లోత్స్",
      "టాయిస్",
      "మందులు / మెడికల్",
      "మొబైల్ రీఛార్జ్ / డిష్ / ఇంటర్నెట్",
      "స్కూల్ / కాలేజ్ ఫీజులు",
      "ఇంటి అద్దె (House Rent)",
      "సిలిండర్ / గ్యాస్ బిల్లు",
      "వాటర్ బిల్లు / క్యాన్లు",
      "పూజ సామాగ్రి",
      "ఇతరాలు",
  ]

category = st.selectbox("Category", categories)
